[
  {
    "title": "G-Star Motion",
    "thumbnail": "g-star",
    "description": "The new Motion feature page was much like the Staq i did before. But this time we had to add some mobile candy in there a well. We used the same approach as we did for the Staq page with the JSON files containing the base64 encoded images. Together with the Draggable API from GSAP i could make the model interactive so the user could spin it around by swiping the model. For the desktop version we even went a step further by adding interactive hotspots.",
    "url": "/projects/g-star-motion.html",
    "openInDialog": "true",
    "tags": ["HTML5","CSS3","Sass","Javascript","RequireJS","canvas","CreateJS","GSAP","JSON"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "Asteroids",
    "thumbnail": "eriknoorland",
    "description": "Getting started with new technologies in a professional environment isn't always possible. This is why side projects are great to be able to experiment with such technologies. For side projects i'm interested in creating (small) games since they have a demand for some math. For this project i chose the 1979 Atari game Asteroids. The technolgy i wanted to get starting on was ES6. Check out the source code on Github.",
    "url": "//demo.eriknoorland.nl/asteroids",
    "tags": ["Javascript","ES6","CreateJS"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "Pikea Dioder",
    "thumbnail": "eriknoorland",
    "description": "After watching endless YouTube video's of peoples clean desks complimented with LED light strips it thought thats what i want to have as well. I went to the nearest Ikea and bought a Dioder LED strip. It worked and it looked really nice! Except for one thing. The LED controller. A couple of horrible white boxes that you had to have in sight to be able to control your LED strip. That's when i thought i could control this LED strip with a Raspberry Pi so i could create a web-app and control the LED's from any web browser (in my local network).",
    "url": "/projects/pikea-dioder.html",
    "openInDialog": "true",
    "tags": ["Raspberry Pi","NodeJS","Socket.io","Soldering iron","Hot glue"],
    "publish": "true",
    "type": "virtual physical"
  },
  {
    "title": "Davor Smoljan",
    "thumbnail": "davorsmoljan",
    "description": "Davor Smoljan is a contemporary artist, muralist, designer and last but not least a good friend. This project is all about visualising his art and creativity. Besides a good design i wanted to focus on some technical aspects as well. I wanted the site te be fast and responsive. I decided to make the site static to minimize server response time.",
    "url": "//www.davorsmoljan.com",
    "tags": ["HTML5","CSS3","Grunt","Assemble","Static","jQuery","Responsive"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "G-Star Staq",
    "thumbnail": "g-star",
    "description": "The Staq campaign was awesome to work on. I mean we're talking about video frames being displayed on a canvas one by one using Javascript. We chose to export all frames as separate images, put those images in a bunch of JSON files as data uri's (so we could load one full sequence at a time) and use CreateJS to toggle the bitmaps on and off the stage. It felt like working with Flash / AS3 all over again. To optimize loading of the assets we optimized the images between the endpoints of each sequence to get the megabytes down from 60+ megabytes to around 10 megabytes.",
    "url": "/projects/g-star-staq.html",
    "openInDialog": "true",
    "tags": ["HTML5","CSS3","Sass","Javascript","RequireJS","canvas","CreateJS","GSAP","JSON"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "G-Star Canvas Carousel",
    "thumbnail": "g-star",
    "description": "We all know carousels and i can say for sure that i hardly liked working on any of them. Except for this one. Instead of the standard slide, swipe or fade carousel i got to create a carousel using the HTML5 canvas. Armed with CreateJS (with knowledge of AS3 in the back of my head) and a set of basic math skills i re-created what the G-Star AV department had created with video tools.",
    "url": "/projects/g-star-canvas-carousel.html",
    "openInDialog": "true",
    "tags": ["HTML5","CSS3","Sass","Javascript","RequireJS","canvas","CreateJS","GSAP","JSON"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "G-Star Jeans Matchmaker",
    "thumbnail": "g-star",
    "description": "How do you wear yours? The Jeans Matchmaker is a mobile first experience in which the user is able to find their perfect pair of jeans. From scratch i was able to build this small app within the existing e-commerce platform. Together with TweenMax, Draggable and the ThrowProps plugin i was able to re-create a Tinder like experience for mobile users.",
    "url": "/projects/g-star-jeans-matchmaker.html",
    "openInDialog": "true",
    "tags": ["HTML5","CSS3","Sass","Javascript","RequireJS","jQuery","GSAP","JSON"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "Blackstroke",
    "thumbnail": "blackstroke",
    "description": "Blackstroke is the band i was part of and as a frontend developer i couldn't just let this oppertunity go to make a project for myself. Because they use Wordpress as their CMS i had to be a little creative with Grunt to make a Wordpress theme out of a static HTML file. The goal was a simple but complete single page website that would match the appearence as a band on stage. It's all about branding i guess.",
    "url": "/projects/blackstroke.html",
    "openInDialog": "true",
    "tags": ["HTML5","CSS3","Javascript","jQuery","Sass","Grunt","Wordpress","Responsive"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "Fixie racing bike",
    "thumbnail": "eriknoorland",
    "description": "Besides programming projects i sometimes get tangled in real world projects like this fixie (or actually, a singlespeed racing bike). After hours of watching YouTube videos, reading blogs and asking questions i started work on my own bike. I can definitely say i learned some lessons in the process. Bikes are more complicated than you might think and you have to get some specialist tools to get the job done.",
    "url": "/projects/fixie.html",
    "openInDialog": "true",
    "tags": ["(socket) Wrenches","chain tool","crank extractor","brute force","spray paint"],
    "publish": "true",
    "type": "physical"
  },
  {
    "title": "JSPR",
    "thumbnail": "jspr",
    "description": "In the short period of time that i had my own company i worked on this frontend together with a freelance friend. It was his client and he asked me to help with the frontend because the deadline was too tight for him to do it alone. It was challenging to get the design pixel perfect translated to HTML but we managed to do so within the time frame.",
    "url": "/projects/jspr.html",
    "openInDialog": "true",
    "tags": ["HTML5","CSS3","Javascript","jQuery"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "Erik Noorland",
    "thumbnail": "eriknoorland",
    "description": "This is my own site. I wanted to post this in my portfolio because of some of the (new) techniques / tools (inline (above the fold) CSS, lazy load Google fonts, src-set for retina images) i used during its construction. For me the requirements for this website were all technical (speed optimisations, performance, etc.).",
    "tags": ["HTML5","CSS3","Javascript","Sass","Grunt","Static","Retina images"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "JSParallax",
    "thumbnail": "javascript",
    "description": "I started this project after i saw ParallaxJS and thought to myself that i had created something similar a couple of years ago in Actionscript 3. I dusted off my old AS3 code and started rewriting it for Javascript. The result? A somewhat similar approach to what i had in AS3 with great performance (in recent browsers using the CSS3 property translate3d).",
    "tags": ["Javascript"],
    "publish": "false",
    "type": "virtual"
  },
  {
    "title": "Hollandsnieuwe",
    "thumbnail": "hollandsnieuwe",
    "description": "The Hollandsnieuwe site was built as a completely static dummy frontend which in a later stadium would be transformed into an Angular app by another collaborating party. I worked on this frontend when i was employed at Chunk.",
    "url": "/projects/hollandsnieuwe.html",
    "openInDialog": "true",
    "tags": ["HTML5","CSS3","Less","Bootstrap 3","Grunt","Static"],
    "publish": "true",
    "type": "virtual"
  },
  {
    "title": "Vodafone Thuis",
    "thumbnail": "vodafone-thuis",
    "description": "The Vodafone Thuis information portal is a static frontend with server-side includes for the branded common header, scripts and footer which were provided by Vodafone's codebase. I worked on this frontend when i was employed at Chunk.",
    "url": "/projects/vodafone.html",
    "openInDialog": "true",
    "tags": ["HTML5","CSS3","Less","jQuery","Bootstrap 2","Grunt","Static"],
    "publish": "true",
    "type": "virtual"
  }
]
